import streamlit as st
import pandas as pd
import numpy as np

# 生成北京市的随机点，其中39.9, 116.4是北京的经纬度
# 首先使用np.random.randn()方法生成1000行2列的符合正态分布的随机点
# 然后在第一列上除以20进行缩小，在第二列上除以50进行缩小
# 最后加上北京市的经纬度。
df = pd.DataFrame(
    np.random.randn(1000, 2) / [20, 50] + [39.9, 116.4],
    columns=['latitude', 'longitude'])
# 设置索引列的名称
df.index.name='序号'

st.subheader('展示部分需要绘制随机点的经纬度')
st.dataframe(df[1:5])

st.subheader('在北京地图上随机画点')
st.map(df)

# 餐厅数据
restaurants_data = {
    "餐厅": ["星艺会尝不忘", "高峰柠檬鸭", "复记老友粉", "好友缘", "西冷牛排店"],
    "类型": ["中餐", "中餐", "快餐", "自助餐", "西餐"],
    "评分": [4.2, 4.5, 4.0, 4.7, 4.3],
    "人均消费(元)": [15, 20, 25, 35, 50],
    "latitude": [22.853838, 22.965046, 22.812200, 22.809105, 22.839699],
    "longitude": [108.222177, 108.353921, 108.266629, 108.378664, 108.245804]
}
